---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.InsertViewsFromFile
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.InsertViewsFromFile

Copies specified views (sheets, schedules, or drafting views) from a project file and saves them in the current project.